<a href="https://colab.research.google.com/github/joohoshin/Python_Basic/blob/master/14_2_%EC%97%91%EC%85%80_%ED%8C%8C%EC%9D%BC_%EC%9D%BD%EA%B8%B0_%EC%93%B0%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 엑셀 파일 쓰기
* to_excel()을 사용하면 손쉽게 엑셀 저장을 할 수 잇습니다

In [ ]:
import pandas as pd
import seaborn as sns

iris = sns.load_dataset('iris')
titanic = sns.load_dataset('titanic')

* 두개의 데이터를 엑셀로 저장을 해봅시다

In [ ]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

* to_excel()을 통해서 엑셀파일로 저장 가능합니다.

In [ ]:
from google.colab import drive
drive.mount('/g')

Drive already mounted at /g; to attempt to forcibly remount, call drive.mount("/g", force_remount=True).

In [ ]:
iris.to_excel('/g/My Drive/Python_202002/iris.xlsx')

* sheet_name 옵션을 통해 시트 이름을 지정할 수 있습니다

In [ ]:
titanic.to_excel('/g/My Drive/Python_202002/titanic.xlsx', sheet_name = 'titanic')

* writer를 통해서 여러개 시트를 만들어서 저장할 수 있습니다

In [ ]:
writer = pd.ExcelWriter('/g/My Drive/Python_202002/titanic2.xlsx')
titanic.to_excel(writer, sheet_name='t1')
titanic.to_excel(writer, sheet_name='t2',index=False)

writer.save()
writer.close()

### 엑셀 읽기
* read_excel()을 활용해서 엑셀 파일을 읽습니다

In [ ]:
data1 = pd.read_excel('/g/My Drive/Python_202002/iris.xlsx')

In [ ]:
data1.head()

   Unnamed: 0  sepal_length  sepal_width  petal_length  petal_width species
0           0           5.1          3.5           1.4          0.2  setosa
1           1           4.9          3.0           1.4          0.2  setosa
2           2           4.7          3.2           1.3          0.2  setosa
3           3           4.6          3.1           1.5          0.2  setosa
4           4           5.0          3.6           1.4          0.2  setosa

In [ ]:
data1 = pd.read_excel('/g/My Drive/Python_202002/iris.xlsx', index_col=0)

In [ ]:
data1

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
data2 = pd.read_excel('/g/My Drive/Python_202002/titanic2.xlsx', sheet_name='t2')

In [ ]:
data2

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]